In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame([],columns=['image_id','Image_3'])

In [4]:
df

Empty DataFrame
Columns: [image_id, Image_3]
Index: []

In [5]:
df.loc[0] = [1,2]

In [6]:
df

  image_id Image_3
0        1       2

In [7]:
df.loc[1] = [1,2]

In [8]:
df

  image_id Image_3
0        1       2
1        1       2

In [16]:
df.loc[len(df)] = [44,55]

In [17]:
df

  image_id Image_3
0        1       2
1        1       2
2       44      55
3       44      55
4       44      55
5       44      55

In [11]:
len(df)

3